---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotComputeProperArea
source: html/fa1bcbff-4c9d-50f5-08bc-e00b6a0ddbed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotComputeProperArea Property

Property Lines must close. Area will not be computed.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotComputeProperArea { get; }
```